export default `
# 个人介绍
一个懒得动弹的宅男，目前本科就读于一个普通的211

高三时觉得程序员来钱快，就选了软件工程这个专业。其实小时候对钱都没什么概念，但是之后发现钱确实很重要，因为我可以接受自己的生活节俭，但我无法忍受自己在意的人和我一样。所以没钱我会感到愧疚。

不喜欢写代码，我感觉写代码本身是没有意义的。网站、小程序、app对我而言没有任何意义，只是在别人给的平台上创作而已，我的所有代码都会在无数年后消失。我追求永恒的事物。

我在上班的路上看同样在上班路上的人（致敬鲁迅的枣树），感觉自己就像是机器，从早到晚，既然写代码对我而言没有意义，那工作对我而言就是出卖时间去追求生活。所以我很讨厌写代码，但我别无他法。

# 技术栈
+ Java
+ JavaScript
+ Dart(Flutter)
+ PHP
+ Python
+ C#(Unity)

其实我接触的第一门语言是C++，这也是在大一的专业课上学的，不过当时就想着早点创业，所以C++都没好好学就上手了JavaScript，这也是我走上开发的开始。因为我上大学之前是没有编程基础的，所以也是懵懵懂懂，现在想想一路确实很多坎坷，毕竟那时候什么都不知道，也没有人指点，看不到方向，只想着把小程序、app做出来，也不知道做这些东西需要什么技术。我到现在都记得当时在B站找app开发教程，跟着视频用rp9和墨刀(这两款都是UI工具，就是做界面设计用的)做app。。。。。。还好没坚持下去，不然就亏大了。

从技术栈可以看的出来我目前主要是在搞开发，其实刚开始学的时候还是觉得有新鲜感，但无一不是写多了就开始烦了，感觉开发这玩意儿写多了以后，对于没有兴趣的人而言就是浪费时间浪费生命。但尴尬的是，不干开发的话，我这智商也搞不来科研啊，于是我现在都没想清楚以后该干什么。要是有钱该有多好啊，就可以安心躺平了，所以看到这了有没有兴趣给我点打赏

当然我不接外包，我有在CSDN写博客的习惯，但是CSDN老有人私聊我代不代写毕设之类的，我虽然穷，但我更懒，不过以后等我快饿死的时候说不定会过来把这段话改成我热爱接外包

# 爱好
+ 看动漫
+ 和朋友打游戏
+ 发呆

说了，又好像没说，这三个不是宅男必备属性吗，那就加一条：搞钱

其实看动漫这个爱好可以从很多地方看出来，我这个昵称'瞳孔'就来自于火影忍者，那时候我应该很小吧，可能是小学或者初中，很喜欢看火影，火影里最秀的忍术大概就是宇智波的瞳术了吧。再加上当时很喜欢物理，对这个世界的规律很感兴趣，所以也就有了那个座右铭：静坐于万花筒，在绚烂中寻找那唯一的本源。当然我现在也还是很喜欢物理，以后要是有钱了可以不上班了，我肯定去考个物理学的研究生。

我这个头像是进击的巨人里的主角艾伦耶格尔，我很喜欢他追求自由的精神，这也是我目前人生阶段的目标，努力让生活更自由。不过我厌恶结局，所以最终季看到一半就没看了，在这里附上巨人迷的经典言论：谏山创去死。

另外看小说也是我的爱好，准确的说是曾经的爱好。那时最喜欢的就是斗破苍穹和龙族，斗破苍穹是我看的第一部小说，那时我应该是小学，写的确实精彩，当然我语文不好，除了这句话我也想不到其他的形容词。龙族对个人形象的塑造以及情感的表现把握的很好，里面有很多各种性格的给我留下深刻印象的角色。不过龙族已经烂尾了，江南老贼应该也知道自己后面写烂了，我高三的时候就断更了，那时候老贼就称自己得了抑郁症，现在都好几年了，这抑郁症还没好，不过貌似抑郁症不影响他拍抖音玩微博。

其实爱好虽然多，但生活压力确实大，小说我高中毕业后就没看过了，动漫也几乎不看了，只是经常和朋友打打游戏，但游戏感觉社交成分更多一点。感觉现在大部分的时间都在写代码或者学写代码，现在失去了很多爱好，可能是因为生活吧。

另外我的英文昵称是eyes，至于为什么不是pupil，那肯定是因为英语不好，记不住。不过很多时候eyes这个昵称都被人注册了，那时候我一般会叫eyesyeager，后面那个yeager其实就是艾伦·耶格尔的耶格尔了。

# 理想
+ 赚很多很多钱
+ 去日本玩
+ 懒得说
+ 省略号

# 关于网站
这是我大二暑假开始写的，虽然我大一就有了个hexo搭建的个人网站，但是hexo扩展性很差，所以一直就想着自己完整写一个，但奈何能力不足，所以一直拖到大二结束才开始写。

开发技术是vue3和springcloud Alibaba，前端UI是模仿了很多网站，主要是模仿hexo的[Butterfly](https://butterfly.js.org/)主题样式，这也是我之前网站的主题，后端是微服务，听上去有点离谱，其实主要还是想练练手，毕竟大项目都是微服务。我刚开始还打算用MicroApp搞个微前端，但想想确实没必要，毕竟微前端效率还不一定有单体应用高。

我给这个网站的定位不是博客网站，再说一遍，这不是博客网站，这是个人网站，博客只是这个网站众多模块里的一个。

这个网站是我个人思想的体现，网站没有任何商业性质，一切都按我的个人喜好建设，不迎合任何人的喜好，只做自己喜欢的内容，所以我给它的命名是个人空间。

# 联系方式
+ 邮箱：eyesyeager@gmail.com
+ bilibili: https://space.bilibili.com/628340506
+ github: https://github.com/YuJiZhao
`;